project3/app/controllers/user_books_controller.rb

  def create
    @user_book = UserBook.new(user_book_params)

    if @user_book.save
---
INSERT INTO "user_books" ("user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["book_id", 2], ["created_at", "2022-12-07 15:38:11.369019"], ["updated_at", "2022-12-07 15:38:11.369019"]]

  def destroy
    @user_book.destroy
---
DELETE FROM "user_books" WHERE "user_books"."id" = ?  [["id", 8]]

    def set_user_book
      @user_book = UserBook.find(params[:id])
---
SELECT "user_books".* FROM "user_books" WHERE "user_books"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]