project3/app/models/user.rb

SELECT "user_books".* FROM "user_books" WHERE "user_books"."user_id" = ?  [["user_id", 2]]
---
    def as_detail_json
        json = self.as_json
        json[:user_books] = self.user_books.includes(:book).map { |ub| ub.as_book_json  }